package data;

public class RoomData
{
	public static String[] roomImgPaths = {"images/s-room-1.jpg", "images/s-room-2.jpg", "images/s-room-3.jpg", "images/s-room-4.jpg", "images/s-room-5.jpg", "images/s-room-6.jpg"};
	public static String[] roomTitle = {"綠意雙人房", "海景雙人房", "藍天雙人房", "家庭四人房", "溫馨四人房", "太陽四人房"};
	public static String[] roomType = {"雙人房", "雙人房", "雙人房", "四人房", "四人房", "四人房"};
	public static String[] roomContext = {"沉浸在翠綠色調的綠意雙人房，享受寧靜氛圍和陽台上的綠意植物，帶來自然舒適的休息空間。",
										  "開窗即見蔚藍大海，海景雙人房以浪漫裝潢和私人陽台提供難忘的海灘度假體驗。",
										  "藍天雙人房以清新的藍色調設計，透過高窗營造明亮空間，提供放鬆身心的居住感。",
										  "寬敞的家庭四人房適合親子入住，溫馨裝潢和完備的家庭設施為您打造溫馨家庭時光。",
										  "溫馨四人房為小型團體或家庭提供愉悅的住宿體驗，舒適床鋪和基本生活設施滿足您的需求。",
										  "太陽四人房充滿陽光，現代裝潢和寬敞空間為多人入住提供輕鬆愉悅的住宿選擇。"};
	
	public static String[] roomDescribe= {"沉浸在環境清幽的綠意雙人房中，您將感受到大自然的靜謐。室內以翠綠色調為主，搭配舒適的雙人床，讓您在寧靜中放鬆身心。陽台上種植著各種綠意植物，提供一個愜意的休憩空間，讓您盡情享受大自然的美好。",
										  "開窗即可迎接壯觀的海景，窗外是潔白的沙灘和蔚藍的大海。房間內部以精心設計的裝潢營造浪漫且舒適的氛圍，配有舒適的雙人床和私人陽台，為您帶來難忘的海灘度假體驗。",
										  "歡迎入住藍天雙人房，這個房型以清新的藍色調為主，為您提供愉悅的住宿體驗。寬敞明亮的空間內設有舒適的雙人床，高窗設計帶來充足的陽光，讓整個房間充滿活力。",
										  "家庭四人房提供充足的空間和舒適的床鋪，適合家庭入住。溫馨的裝潢和家庭設施，讓您在這裡度過美好的家庭時光。",
										  "溫馨四人房是小型團體或家庭的理想之選。房內的裝潢溫馨，提供輕鬆愉悅的住宿體驗，同時配有基本的生活設施，讓您感受到賓至如歸的溫馨。",
										  "光線明亮的太陽四人房，是寬敞的住宿選擇，適合多人入住。現代化的裝潢與舒適的床鋪，為您創造出愉快而輕鬆的住宿環境。"};
	
	public static String[] roomPrice={"NT$2,800 / 晚", "NT$3,200 / 晚", "NT$3,000 / 晚", "NT$4,500 / 晚", "NT$4,200 / 晚", "NT$4,800 / 晚"};
	public static String[] roomfloor={"2樓", "3樓", "4樓", "2樓", "3樓", "4樓"};
	public static String[] roomSquare={"約 20 坪", "約 25 坪", "約 22 坪", "約 30 坪", "約 28 坪", "約 32 坪"};
	public static String[] roomBeds={"一張雙人床", "一張雙人床", "兩張單人床", "兩張雙人床", "兩張雙人床", "兩張單人床+一張雙人床"};
	public static String[] roomPeople={"最多容納2人", "最多容納2人", "最多容納2人", "最多容納4人", "最多容納4人", "最多容納4人"};
}
